#+TITLE: FormulaPages

Formula pages is a project to develop high quality building blocks compatible with spreadsheets.

These building blocks are published on NPM for node and are compatible with tools like webpack or browserify.

The libarries are packaged as UMD modules but they will clutter global namespace if you don't bundle your code with webpack or similar.

The source code is mostly written in ES6 with the exception of the parser which is written in jison.

This project is very similar to [[https://github.com/sutoiku/formula.js/][formula.js]]; except that this project includes a compiler. 

Currently, the formula.js project has much more coverage and many of the function need to be ported.

  |---+----------------------+-----------+-------+--------+-----+----------+--------+------|
  |   | Category             | Completed | Total | Github | NPM | CircleCI | % Done | % CI |
  |---+----------------------+-----------+-------+--------+-----+----------+--------+------|
  | # | Logical              |         9 |     9 |      9 |   9 |        1 | 100.0% |      |
  | # | Date and Time        |        17 |    23 |      0 |   0 |        0 |  74.0% |      |
  | # | Engineering          |         2 |    51 |      0 |   0 |        0 |   4.0% |      |
  | # | Financial            |         8 |    31 |      0 |   0 |        0 |  26.0% |      |
  | # | Information          |        22 |    23 |     11 |  11 |        0 |  96.0% |      |
  | # | Lookup and Reference |        12 |    12 |      3 |   3 |        0 | 100.0% |      |
  | # | Math                 |        44 |    69 |     11 |  11 |        0 |  64.0% |      |
  | # | Stats                |         5 |    54 |      0 |   0 |        0 |  10.0% |      |
  | # | Text                 |        24 |    29 |      0 |   0 |        0 |  83.0% |      |
  |---+----------------------+-----------+-------+--------+-----+----------+--------+------|
  | # | Total                |       124 |   227 |        |     |          |  55.0% |      |
  |---+----------------------+-----------+-------+--------+-----+----------+--------+------|
  #+TBLFM: @3$8='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@4$8='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@5$8='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@6$8='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@2$8='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@7$8='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@8$8='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@9$8='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@10$8='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")::@11$3=vsum(@5..10)::@11$4=vsum(@5..10)::@11$8='(concat (number-to-string (fceiling (* 100 (/ (string-to-number (concat $3 ".0")) (string-to-number $4))))) "%")
